[
    {
        "banner_image":"/img/projects/BACtracker/squiggle.png",
        "ProjectName": "BACtracker",
        "type": "School project (Informatics Capstone)", 
        "duration": "5 months \n(January 2023 - June 2023)",
        "role": "Developer, Designer, Researcher",
        "tools": "React Native, Firebase, REST api, Agile Development, Git",
        "summary": "Our group has created and implemented a mobile application that serves as a toolkit on safe alcohol consumption practices for our fellow peers. The app provides a hub of information regarding alcohol consumption, safety practices, and general resources. Using user specific demographics and information, the app can also calculate the BAC (Blood Alcohol Content) of the user as they input the different drinks they have consumed.",
        "context": "Overuse of alcohol at a young age can lead to dangerous in-the-moment and long-term consequences. However, current legal restrictions and preventive approaches are not sufficient to reduce alcohol abuse; information gaps and misinformation regarding alcohol safety remain.",
        "inspiration": "As a group of young adults near the age of 21, we wanted to work on a problem that was relevant to us as well as the community around us. Through the process of narrowing down our topic, we realized a common situation that many of us face at this age: navigating drinking alcohol in a social setting. Upon reflecting on our own experiences and knowledge, we realized the wide range between the four of us in how much we knew about drinking and alcohol safety. Some of us had significant gaps in our knowledge due to either inexperience or misinformation that could potentially lead to poor decision-making. Furthermore, as a group consisting of female and non-binary individuals, we recognized our demographic's vulnerability with regards to alcohol safety. Even within our small group, we identified a common ground stemming from a lack of proper education and knowledge of tools and tips to stay safe while drinking.",
        "problem_statement": "\"How might young adults obtain and retain greater knowledge and understanding of alcohol consumption safety practices so that they can make more informed decisions about alcohol consumption?\"",
        "ideation": "To further understand our problem space, we conducted literature, market, and user research. Our literature review revealed the importance of shrinking and eliminating the information gap regarding alcohol safety. Overuse of alcohol at a young age can lead to dangerous in-the-moment decisions and unhealthy long-term habits. Today, a large percentage of teens and young adults experience alcohol-related disorders and deaths. Additionally, our literature review revealed why this information gap and misinformation exist. While laws preventing underage drinking and dangerous choices exist, they are not sufficient enough to address the issue. This mainly stems from the lack of information about existing resources. Finally, as our market research shows, existing online resources and technological platforms are not intuitive or catered towards young adults. Our research also revealed the significance of physicality in alcohol consumption. Cisgender heterosexual women experience more alcohol-related consequences per drink due to the physical makeup of their bodies.",
        "implementation": "We also understood the difficulty of creating an accurate BAC calculator due to the complex algorithms used to calculate BAC. Upon finding open-source code for a different application explored in our market research, DrunkCalc, members of our group began researching and adapting the code and existing algorithm to fit our application. We built our MVP to meet the basic needs of our users: having the ability to seek and gain information regarding safe alcohol consumption, as well as calculate BAC based on inputted personal metrics and alcoholic drinks. As all four of our group members had development experience and felt comfortable contributing to the development process, we split up the different features and components within the application to create an MVP product. As our goal for the MVP was to have an application that contained an information hub and was able to calculate a BAC without crashing, the design and aesthetic of our app was a lower priority. However, we continued developing our app's UI design in our next iteration.",
        "reflection": "As a developer, I absolutely loved working with this team. Despite having almost no knowledge of React Native coming into the project, we were able to work together and create a working prototype. Since this project was completed over the course of two quarters, there is still room for improvement and opportunities for expanding the work that we have created. Upon reflecting on these opportunities, our group has decided to open source our project. There were no outside parties or stakeholders involved, allowing for a smooth transition into an open-source project.",
        "link": "https://bactracker-be654.web.app/",
        "github": "https://github.com/iBant-Capstone/source-code",
        "img_1": "/img/projects/BACtracker/img_1.png",
        "img_2": "/img/projects/BACtracker/img_2.png"
    },
    {
        "banner_image":"/img/projects/Conscious/leaf-banner.jpg",
        "ProjectName": "Conscious",
        "type": "School project (INFO 442: Cooperative Software Development)", 
        "duration": "2 months \n(October 2022 - December 2022)",
        "role": "Front-end Developer",
        "tools": "React.js, REST api, Agile Development",
        "summary": "We developed a website aimed at enlightening consumers about the ramifications of the fast fashion industry while also highlighting sustainable brands as viable alternatives for conscientious shopping decisions.",
        "context": "Rather than solely urging fast fashion companies to adopt sustainability practices, our focus lies in empowering consumers to make responsible and sustainable shopping choices. Our mission is to raise awareness among consumers about the environmental impacts of the fast fashion industry while advocating for more conscious consumption habits.",
        "inspiration": "Fast fashion contributes to the emission of greenhouse gasses and the use of massive amounts of water and energy. In order to produce one kilogram of non-organic cotton, over 2,000 liters of water is used. Additionally, fast fashion brands often use synthetic materials that take hundreds of years to biodegrade, and that end up releasing microplastics and chemical waste into the ocean. Based on statements made by the United Nations Foundation, climate change is an incredibly unsustainable pattern, which fast fashion is a major contributor. Currently, the clothing industry negatively affects the environment through malpractice and sourcing raw materials unethically. If nothing is done, the industry will continue to mass produce clothing that may be less expensive for the consumer but detrimental to the environment, contributing to the growing issue of climate change.",
        "problem_statement": "This project seeks to create an application to answer the question \"How might we raise awareness in young adults about the environmental impact of the fast fashion industry while simultaneously promoting alternative, sustainable brands?\"",
        "ideation": "Our feature list encompasses various priority levels. At the forefront (P0), we've implemented a responsive navigation bar for seamless user interaction, coupled with an informative \"Are your clothes sustainable\" checklist and information page, designed to catalyze consumer behavior change. Additionally, users can delve into research-based insights on the environmental impact of the fast fashion industry and gain clarity on the unsustainability of specific clothing brands/types. We also feature a carousel or display highlighting general brands/websites endorsing sustainable fashion. Moving to priority level 1 (P1), users can benefit from a carousel sort feature, allowing them to prioritize factors such as cost efficiency, maximum sustainability, and ease of purchase. Moreover, a personalized recommendation system suggests sustainable brands aligned with users' preferred style or clothing type. In consideration of potential enhancements (P2), we contemplate integrating capsule closet suggestions, promoting timeless pieces over trendy fast fashion items. Users also have the capability to bookmark preferred brands/styles and access an API or external database for comprehensive clothing brand/options information.",
        "implementation": "Our code will adhere to the conventional React project structure, organized into main components to streamline development and minimize redundancy. This approach ensures efficiency by centralizing common elements such as the navigation component, which can be effortlessly implemented across all web application pages with minimal code repetition. Each page of the website will reside in its own file, reducing the likelihood of errors and simplifying code maintenance. Modifications to specific pages can be made efficiently by altering the corresponding file, enhancing overall code manageability. Moreover, we will utilize JSON files to store values, eliminating the need for hardcoded values and facilitating future adjustments and integration with external APIs. For hosting, we have opted for Firebase, a platform known for its compatibility with backend servers and user-friendly hosting capabilities. Given our team's familiarity with Firebase and its simplicity, it serves as an optimal choice for our project's hosting needs.",
        "reflection": "As a Front-end Developer working on this project, my experience was incredibly enriching and impactful. Over the span of two months I was able to learn more about what working in the industry with a mixed team would be like. I believe that learning Agile development will be incredibly helpful as I progress through my career. Reflecting on my project experience, I found myself really interested in the sustainability aspect of the topic. Helping consumers make more informed desicions about the environmental implications of fast fashion while promoting sustainable alternatives resonated deeply with me. Climate tech is something that I am interested in learning more about!",
        "link": "https://conscious-96dae.web.app/",
        "github": "https://github.com/UW-INFO442-AU22/TechGirlies",
        "img_1": "/img/projects/Conscious/Find Brands.png",
        "img_2": "/img/projects/Conscious/Find Styles.png"
    },
    {
        "banner_image": "/img/projects/CandySearch/candy-banner.jpeg",
        "ProjectName": "CandySearcher",
        "type": "School project (INFO 340: Client-Side Web Development)", 
        "duration": "3 months (Mar 2021 - Jun 2021)",
        "role": "Front-end Developer",
        "tools": "HTML, CSS, React.js",
        "summary": "We created an interactive website that helped people make informed decisions about their candy bars",
        "context": "In the diverse landscape of candy bars, packaging styles vary, making it challenging for consumers to decipher nutrition labels accurately. The prevalent issue lies in limited awareness of candy beyond popular brands, hindering individuals from discovering alternatives that align better with their preferences. Moreover, many struggle with interpreting nutrition labels, complicating the identification of sugar content and adherence to dietary restrictions.",
        "problem_statement": "This project seeks to create an application to answer the question \"How might we provide information about allergens, nutrition, taste, and  texture to young adults to find new candies that match their tastes?\"",
        "inspiration": "Currently, there are no web applications available to assist individuals in selecting a type of candy to consume. Consequently, people primarily depend on the advertising, packaging, and labeling of the candy bar to determine its contents and suitability for consumption. Certain members of our group have allergies to specific types of nuts or ingredients, which restricts their ability to consume certain candies.",
        "ideation": "In the design phase, I recognized that the search and filter elements were crucial features, so I prioritized their visibility on the screen. Regarding color selection, we opted for purple as our primary color, symbolizing our identity as UW students. We implemented two distinct ways to view the data: a list and grid view as shown in the figures above. Before creating the wireframes, we selected a dataset containing the necessary candy information from kaggle, which facilitated the organization of candies on the page. (https://www.kaggle.com/datasets/alexisbcook/data-for-datavis) ",
        "implementation": "The development process unfolded in two distinct phases. Initially, we constructed the entire website using HTML, CSS, and JavaScript. During the subsequent phase, we transitioned the codebase to React.js while integrating two novel functionalities inspired by the feedback garnered during the initial phase. These new features enabled users to have a more interactive experience with our app. The first one involved giving the user the chance to add new chocolates to the dataset based on new candies they had eaten that were not in our existing database. We also implemented a feature to enable the user to “favorite” any candies they like. Implementation of these features and the hosting of the website was done through Firebase.",
        "reflection": "Through this project, I gained proficiency in utilizing React.js, mastering the management of states and components, while also learning to leverage Firebase for site hosting. Additionally, my debugging capabilities significantly improved as a result of encountering numerous challenges during the initial development phase. As the sole team member with coding experience, I forced myself to be more patient when it came to analyzing and fixing the errors. If I were to do this project differently, I would like to do more design iterations and dedicate more time to code reviews to increase readability. Because time was limited and this was my first React project, I didn’t really get the opportunity to focus on those elements, but I definitely improved my design and coding skills.", 
        "link": "https://candy-website-whippersnappers.web.app/", 
        "github": "https://github.com/info340-wi21/project-2-rsrika",
        "img_1": "/img/projects/CandySearch/portfolio content.png",
        "img_2": "/img/projects/CandySearch/portfolio content1.png"

    }
]