[
    {
     
        "ProjectName": "CandySearcher",
        "timeline": "3 months (March 2021 - June 2021)",
        "role": "Front-end Developer",
        "summary": "We created an interactive website that helped people make informed decisions about their candy bars",
        "context": "The various different types of candy bars out there often have different types of packaging, and it can be difficult for people to read nutrition labels correctly. The current problem with candy choices is that people only often know about the larger brands of candy so they might not be exposed to other types of candy that might suit their preferences better. Furthermore, many people do not know how to correctly read a nutrition label, so finding the sugar content, or finding out if a type of candy violates dietary restrictions can be difficult.",
        "inspiration": "As of now, there are no web app solutions to helping people choose a type of candy to eat, and instead, people rely on the advertising, packaging, and labeling of the candy bar itself to find out what it contains and whether or not they can eat it. The question we aimed to answer was \"How might we provide information about allergens, nutrition, taste, and  texture to young adults to find new candies that match their tastes?\"",
        "ideation": "When it came to the design process, I knew that two of the most important features would be the search and filter elements, so I wanted to prominently display those on the screen. With regards to color choice, we chose purple to be our primary color since it represented us as UW students. We had to create two ways in which the data could be viewed, so we designed a list and grid view (see Figure 1). Prior to designing the wireframes, we chose a dataset with the candy information we needed, and this helped us arrange the different candies on the page.",
        "implementation": "There were two phases to the development process. First, we coded the entire site in HTML, CSS, and JS. For round two, we converted the code to React.js and added two new features based on the feedback received during the first phase. These features involved giving the user the chance to add new chocolates to the dataset and “favorite” any chocolates they like. Implementation of these features and the hosting of the website was done through Firebase.",
        "reflection": "Through this project, I learned how to use React.js by using states and components and Firebase to host the site. My debugging abilities also became stronger. Because there were a lot of issues during the initial development and I was the only one on my team with coding experience, I forced myself to be more patient when it came to analyzing and fixing the errors. If I were to do this project differently, I would probably do more design iterations and review the code more to increase readability. Because time was limited and this was my first React project, I didn’t really get the opportunity to focus on those elements, but I definitely improved my design and coding skills.", 
        "link": "https://candy-website-whippersnappers.web.app/", 
        "github": "https://github.com/info340-wi21/project-2-rsrika",
        "img_1": "/img/projects/CandySearch/portfolio content.png",
        "img_2": "/img/projects/CandySearch/portfolio content1.png"

    },

    {
        "ProjectName": "Conscious",
        "timeline": "2 months (October 2022 - December 2022)",
        "role": "Front-end Developer",
        "summary": "We built a website that can educate consumers about the impacts of the fast fashion industry and identify alternative sustainable brands to shop at",
        "context": "Instead of trying to encourage fast fashion companies to become more sustainable, we are trying to target the consumer side of the problem by encouraging consumers to shop more responsibly and sustainably and enlighten consumers on the environmental effects of the fast fashion industry.",
        "inspiration": "Fast fashion contributes to the emission of greenhouse gasses and the use of massive amounts of water and energy. In order to produce one kilogram of non-organic cotton, over 2,000 liters of water is used. Additionally, fast fashion brands often use synthetic materials that take hundreds of years to biodegrade, and that end up releasing microplastics and chemical waste into the ocean. Based on statements made by the United Nations Foundation, climate change is an incredibly unsustainable pattern, which fast fashion is a major contributor. Currently, the clothing industry negatively affects the environment through malpractice and sourcing raw materials unethically. If nothing is done, the industry will continue to mass produce clothing that may be less expensive for the consumer but detrimental to the environment, contributing to the growing issue of climate change. The questio we aim to answer is \"How might we raise awareness in young adults about the environmental impact of the fast fashion industry while simultaneously promoting alternative, sustainable brands?\"",
        "ideation": "P0: Responsive navigation bar, “Are your clothes sustainable” check-list/information page to allow consumers to change their behavior when looking at clothes, Research-based information (background) regarding the effects of the fast fashion industry on the environment, Why specifically ____ brands/types of clothing are unsustainable, Carousel or display of general brands/websites that feature and support sustainable fashion \n\n P1: Carousel sort feature - allow users to prioritize cost efficiency, maximum sustainability, ease of purchase, etc., “If you like ___ type of style/clothing you might like ____ brand” - sustainable brand suggestions from corresponding to the type of clothing the user would like to purchase \n\n P2: Possible additional feature: capsule closet suggestions (staples) - timeless pieces of clothing > trendy fast fashion, Ability to bookmark brands/styles a user likes, API or external database for clothing brand/options",
        "implementation": "Our code will be organized into main components that follow the typical React project structure. This will reduce redundancy and repeating code throughout the project. For example, there will be a navigation component that will then be implemented in each page of the web application using only one line of code. Each page of the website will have its own file to reduce necessary mistakes and will result in easier maintenance of the code. For example, if changes are necessary on one page of the web application, only the file corresponding to that specific page will be altered. Additionally, we will be using JSON files to store our values without having “magic” numbers and descriptions in our code base. This will make it easier to modify our descriptions and add complexity to our projects (with APIs). Our solution will be hosted via firebase. This way, it is most easily compatible with a back-end server, if we choose to implement a back-end within our final phase of development. Firebase is also fairly simple to host on, and our team has prior experience using Firebase.",
        "reflection": "This project is still in progress! Check back later to see my reflection!",
        "link": "https://conscious-96dae.web.app/",
        "github": "https://github.com/UW-INFO442-AU22/TechGirlies",
        "img_1": "/img/projects/Conscious/Find Brands.png",
        "img_2": "/img/projects/Conscious/Find Styles.png"
    }
]