[
    {
        "Title": "AUTUMN QUARTER 2020",
        "reflection": "Goodbye high school, hello college! Graduating high school and embarking on my college journey at the peak of the COVID-19 pandemic led to an unorthodox start to my first quarter at UW. While I was basically a Zoom expert at this point, I was definitely nervous to navigate the virtual college environment academically, socially, and personally. I wanted to perform well in school while also finding ways to meet new people in my year and major as an informatics direct admit. Despite all the new experiences thrown at me, I was able to not only push myself to learn new things in my classes, but also meet people this quarter that I know I will continue to be friends with throughout my time at UW. \n I was also encouraged to run as First Year Representative for WINFO (Women in Informatics). I have never run for a position like this before and I was excited to be chosen! It was so amazing to meet all of the other WINFO Officers, and the other FYRs, Melina and Sam. From my informatics cohort to my honors classmates, fellow WINFO officers and professors, I had the opportunity to meet some incredible human beings this quarter. Everyone has been extremely welcoming and supportive throughout my first quarter here and enabled an easier transition into my college life. \n Furthermore, I teamed up with some of these people for group projects, which taught me about the contributions and impact I can make as a team member as well as how I can best collaborate with others. My first quarter in Honors and at UW surprised me with regards to how different and engaging college classes can be. I came into this quarter expecting that the INFO classes I were taking would remain on the technical side, and the HONORS classes would remain on the humanities side. Rather, I found that my HONORS classes have exposed me to many technical topics, such as bioengineering, physics, astronomy, and storytelling. Although my INFO classes were technical on some level, they have also introduced me to social concepts like networking and presenting myself at career fairs. Having lived in Washington for most of my life, I had heard stories about the Seattle freeze, and was thus worried about making friends because I did not know anyone else taking INFO and pursuing HONORS. However, my experience was very different, and I was pleasantly amazed to find so many welcoming people at UW. \nI have been able to interact with so many awesome students, TAs, and professors that have made my first quarter and UW journey more worthwhile. Taking classes such as HONORS 100 exposed me to learning about several interesting opportunities that I would like to seek in the future. Later during my time at UW, I plan on exploring study abroad opportunities for my experiential learning projects because I am excited for the chance to see the world (when it is safe to, of course) and pursue my interests in climate change and society beyond a technical context. By the end of my first year in Honors, I want to have a better understanding of what experiential learning opportunities I would like to have while also making more new friends in the Honors program so that I can have my own small community within one large UW community. \nI’m proud to say I’ve already taken the steps towards this, as I was elected to be one of the first-year representatives of WINFO! I planned my first WINFO event as well, helping to put on Chatsgiving with the other representatives. By the time I graduate, I want to use all the skills I have learned to help me professionally and personally as I start my career, creating positive societal change through the work I do.",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\4 - year plan.PNG", "gallery_alt": "A table showing the list of classes I want to take each quarter", "gallery_reflection":"This is the tentative four-year plan I made in HONORS 100. The different colors on the plan are for different requirements I want to meet, whether it is for the Interdisciplinary Honors program, or for the Informatics program. This plan has helped me better understand what I want to accomplish academically throughout my time at UW, and has helped me visualize the workload I will have for each quarter over the next four years. "}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Cover Image 200 Project.PNG", "gallery_alt": "A stylized woman looking at an hourglass on top of a list of papers", "gallery_reflection":"​This is the cover page image for my INFO 200 group project. While this project has helped me understand more about the different components of informatics, it has also helped me build connections within the iSchool. Through working on our project, I have been able to build friendships with all my team members, even though we have never met in person. I have also been able to understand more about what I can contribute to a team and how that can benefit others in my group."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\First WINFO fyr.PNG", "gallery_alt": "A zoom screen showing all of the WINFO Officers", "gallery_reflection":"This is a screenshot from the first Winfo (Women in Informatics) meeting I attended as a First Year Representative! Being a part of Winfo has helped me become more confident with who I am, and has also given me a sense of involvement within the iSchool community at UW. My role as an FYR is to plan events each quarter, and to shadow the other officers so I can see what roles I am interested in for the future. This quarter, we hosted a social event called \"Chatsgiving\" where we got together and made hand turkeys with new admits to the iSchool!"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Learning R.PNG", "gallery_alt": "A map of the united states with blue dots over Washington, Wyoming, Michigan, and Maryland", "gallery_reflection":"​This is a screenshot of the results of one of the exercises we did for INFO 201. I was nervous to take this class because I knew it would be in R, a programming language that I had no experience with. However, after taking this class, I have learned how to study for things that I do not have experience with, watching the lectures and searching up terms that I find confusing, so that I can contribute to my own learning. I have also learned how to use important tools, like git, for collaboration, which is an important skill to understand for the workplace."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Mango_bed.jpg", "gallery_alt": "A goldendoodle sleeping on a bed", "gallery_reflection":"Taking classes online often means long hours looking at my computer. Luckily, I always get reminders to take a break and have a litte nap from Mango! I think he has gotten a lot more clingy since he's now used to us being at home, so I have more of an opportunity to take cute pictures like this."}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Roshni_in_class.jpg", "gallery_alt": "A goldendoodle sitting on my lap while I sit in on a zoom class", "gallery_reflection":"Sometimes, it's hard to find connection in online classes. One of the best ways I have seen to do this is through introducing pets! Although sometimes, Mango just gets the urge to sit in my lap when he doesn't get enough attention from me."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Roshni_Mods.jpg", "gallery_alt": "", "gallery_reflection":"This picture was from the first time I went to campus as a UW student! It was so exciting to be a part of dawg daze, and to explore all of the different parts of campus with Sai and Anjul. The vibes felt different, and I knew it was going to be the start of a great year."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Roshni_pillars.jpg", "gallery_alt": "Roshni standing in front of the second pillar in Sylvan Grove", "gallery_reflection":"While I didn't get much of a \"start\" at UW, I did get to go to campus during Dawg Daze at the start of the year. I took the opportunity to go to Sylvan Grove and touch the second pillar - Industry. I want to use my college experience to gain the skills I need in order to be successful in my career, as well as the ability to be industrious and resilient to challenges."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Fall\\Thing.jpg", "gallery_alt": "", "gallery_reflection":"​This is my photo of a \"Thing\" from my HONORS 220 A class, \"Storytelling in the Sciences.\" I started out thinking that this class was going to be about writing, specifically being able to write scientific literature in a way that was appealing to readers, but I was surprised when I found out that this class was actually more focused on presenting science in an understandable way. Each lecture, we start out by doing improv, and then move to telling myths, and presenting. This class has helped me become more confident when thinking about presenting to other people."}
        ]
    },

    {
        "Title": "WINTER QUARTER 2021",
        "reflection": "2021 started off with a (literal) bang and the start of winter quarter will be one that I remember for the rest of my life. Hearing about the insurrection on the US Capitol in the middle of one of my lectures completely took me aback. This was followed by many other events in the same vein, including the Biden inauguration and the explosion of racism against Asian Americans. \nOther UW students always told me that Winter quarter would be the most difficult, and that came true academically - I just didn’t expect it to happen so much on a political scale. Having paid attention to the politics of the last ten weeks, it feels like I have peeled back a curtain of how the nation and the world has been operating, looking at the globe with my now-slightly-faded rose-tinted glasses. On a brighter note, COVID-19 vaccine distribution has provided hope for helping the pandemic, but especially in times like these, I felt it was important to find the good in the midst of the chaos. Compared to the fall, I had a much lighter workload this quarter, taking 3 classes worth 15 credits instead of five classes worth 17. The courses were also less technical overall, with the only technical class being CSE 143, which I suppose was less difficult than people said considering it was online and I had been introduced to some of the concepts before. My TA for the class, Kimi, also recommended that I apply to become a TA for CSE 143! I did apply, and made it through the first round, but unfortunately, I did not move past the round where I had to submit a video of me teaching for loops. I personally believe that I am qualified for the role, and will probably apply for the job next quarter as well, or potentially apply to be a TA for another course. \n​Outside of class, I have worked on my goals of building a network, and have been becoming more involved with WINFO as a first-year rep. I participated in the hackathon in January with Vidhi, Annika, and Anushka. This was the first hackathon I had ever participated in, and I even ended up working on the project until 3 in the morning, just to get a finished project. Even though we did not win an aways, I was part of the FYR team who designed the masks that were sent out in the swag pack, which look really cool. The FYR team also hosted an event called Pitch Perfect, where people could work with industry professionals and the iSchool career services to craft their elevator pitches, and it was a huge success. I also have been able to attend Diversity Committee meetings since joining towards the end of last quarter, and have been able to be a part of more events. This quarter, we had the Microaggressions Power Hour, as well as the “Keep Calm and Curry on” dead week event. I really enjoy being a part of the committee and I am glad I have gotten a chance to bond with and get to know everyone (Harkiran - the Director of Diversity Efforts, Rachel - the Director of Community Efforts, as well as Duaa and Gisele - the other committee members) better. Going to these meetings is something I look forward to a lot, and it’s a really fun experience to be a part of. I also ran for Director of Diversity Efforts later this quarter and got elected! I am looking forward to continuing to contribute to the diversity efforts for WINFO and the iSchool next year.",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\CSE 143 grammar solver.PNG", "gallery_alt": "A screenshot of code", "gallery_reflection":"This is a screenshot of my Grammar Solver project from CSE 143! I really enjoyed taking this class, despite the many horror stories I had heard about it. I learned a lot about data structures, and I feel like this was the first class where taking Data Structures paid off. I thought this project was particularly interesting because of the way the end result was able to generate random sentences by choosing specific words from different sentences.  Although I already knew all of the concepts coming into the class, and even had done similar projects, I came out of the class learning about how to write cleaner code without redundancies. I really enjoyed the work that I have done, and I stored it in my GitHub.​"}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\Election results.PNG", "gallery_alt": "", "gallery_reflection":"I feel like this picture encapsulates one of my biggest accomplishments this quarter. Through my work as a first year rep, and by being a part of the diversity committee, I grew confident enough to run for the Director of Diversity position. I was running against someone else, and to my surprise, I actually won! I couldn't have been able to accomplish this without all of the support I recieved from Harkiran, Duaa, Gisele, and Rachel - they all helped me feel more confident in my abilities!"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\HONORS 211 - Waiting.PNG", "gallery_alt": "A slide showcasing a green pallu, stiched with a red border.", "gallery_reflection":" expected this class to be more theory based, and was surprised when we actually had to physically make some of the projects.  Taking this class has taught me many new skills, including sewing, and has also given me an appreciation for the history of art practices, specifically textile work. One of the biggest projects I did for this class was to modify a piece of clothing to embody the concept of 'waiting'. I chose to make a green pallu, because I wanted to represent parts of my own culture in the fabric that I was making. I used fabric paint to paint a series of plants growing with each pleat to symbolize that waiting could lead to growth and that learning takes time. I also added peices of broken cds in more and more fractured squares to showcase that waiting could also be destructive and lead ot fragmentation."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\FLL_MAAVS.jpg", "gallery_alt": "A group of girls wearing masks and standing around a robotics table.", "gallery_reflection":"This quarter, I also helped volunteer to teach a team of girls about robotics, and helped them participate in FIRST Lego League, a competition where you program a lego robot to make it through a board full of missions. It was a really interesting experience being a mentor to the team, because it was my first time being the sole mentor, and often I felt like I was talking to the parents more than the girls. I loved talking to them though and I hope to see them win!"}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\Harkiran_note.jpg", "gallery_alt": "A card thanking me for all of the work I did on the diversity committee this year.", "gallery_reflection":"I got this note from Harkiran after I won the election, and I thought it was one of the sweetest things I have recieved this year! It also came with a target gift card (hehehe)"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\food event post.PNG", "gallery_alt": "A facebook post showing the event details for 'End of Quarter Social Event (Diversity Style)' ", "gallery_reflection":"This event was one of the first ones that the diversity committee hosted aftere I was elected, and it was end-of-quarter event, where we discussed food form our cultures to relax after finals. While the turnout wasn't high, I thought it was one of the more impactful events that I worked on because I got to learn more about the snacks from different cultures. It was amusing how three of us, (me, Duaa, and Harkiran) all showed up with mixture as a snack"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\Hackathon.PNG", "gallery_alt": "A screenshot of the Not Alone project cover page", "gallery_reflection":"This year was also the first time I have ever participated in a hackathon. I worked with Annika, Vidhi, and another person named Anushka. We created a product called Not Alone (I know it's not the best name) that aimed to help people of color find access to mental helath resources through an app. It was really interesting to me to put all of my Figma skills to use from INFO 200!"}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Winter\\Podcast Post.PNG", "gallery_alt": "A screenshot of an instagram post of the podcast that I was in!", "gallery_reflection":"I think one of my most out-of-the-box experiences that I have had this quarter was being on a podcast that Gisele hosted. it was really cool to talk about mental health with Thomas, and also just have fun chatting about the different aspects and stigmas surrounding mental health. It was also my first time ever being on a podcast, and I think it was a really fun experience! I know I have a lot of ums and uhs in my speech, so I have still never listened to the episode!"}
        ]

    }, 
    
    
    {
        "Title": "SPRING QUARTER 2021",
        "reflection": "If I had to choose a defining word for this quarter, I would choose ‘complicated’. For me, Spring 2021 was the start of a lot of new things, but also filled with hardships created by the ongoing coronavirus pandemic in India. Although things have somewhat stabilized now, the past five weeks have continued to create a massive shift in the way I think about the world, and how much I appreciate the people who have been a part of my life so far. For me, the hardest part of the quarter was balancing my school and personal life. At the start of the quarter, I was also fully onboarded as WINFO Director of Diversity. This meant that I started to actually plan the diversity committee meetings, as well as joined the iSchool IDEAS committee meetings. When I started taking responsibility for all of these meetings, I honestly felt like I knew nothing about what was going on, but I am very thankful to have had Harkiran help me navigate all the different aspects I now have to manage. My work as diversity director has been really rewarding thus far, and I am excited to be working with everyone to plan some really cool events! \nEven though I was taking 17 credits this quarter, I found myself pleasantly surprised that I was not swamped with assignments. However, One of the most challenging classes I took this quarter was INFO 340, which was focused on client-side development. Despite this being a technical class, I had never coded in HTML, CSS, and JavaScript before, but learning these skills helped me to get an internship at Tech For Good as a Full Stack Developer this summer. \nMy favorite class this quarter was INFO 498, or “The Future of the Record” with Professor Joe Janes. I think I enjoyed this class so much because the lectures were really engaging, and I learned about the different aspects of information documents and information systems, as well as what these might look like in the future. As the academic year nears its end, I am still getting used to the idea that I am no longer going to be a freshman in college anymore. This year has been one of the most unique ones I have had so far, and I am still hopeful for what the future will bring. Spring quarter has also allowed me to feel more like a “typical American” college student. Some of the best moments have been when I visited Seattle to meet up with Harkiran, Gisele, Duaa, and Melina, as well as when a few of them came up to Redmond to visit me. These moments helped me feel more connected to my friends, who I have only seen virtually until now. I’ve had some of the most eventful times of my life this quarter, and I know I’m not going to forget it. In future quarters, I hope to be able to meet and build relationships with more people, and positively contribute to the communities around me.",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\columbia city RSJ with comments.JPG", "gallery_alt": "A screenshot of a paper that I wrote about Columbia City", "gallery_reflection":"This class was really interesting for me. I spent a lot of time learning about how to evaluate a neighborhood based off of its environmental characteristics as well as paying a lot of attention to race and social justice. I think this was a really important class for me to take because I found out that there is so much more to sustainability than just how many trees or plants are in an area, it also has to do with things like food deserts or affordable child care and not having to drive around everywhere! This class really opened my eyes to those possibilities"}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\day 1 ppt.JPG", "gallery_alt": "A screenshot of a slide from my 'Fry Day' a picture from a potluck full of fried foods made by my friends", "gallery_reflection":"Taking INFO 498 was honestly one of the best decisions I have made this quarter. I spent a lot of time learning about the different ways that people create and use documentation from things like the vaccine cards created for the pandemic as well as older forms of documentation like birth certificates. In this class I wrote a paper about the documentation systems surrounding Carnatic music, which is something that I am passionate about, and I also learned a lot about why information is so important and so prevalent. Taking this class felt like a more in-depth version of INFO 200 and I spent a lot of time talking to Professor James and he even offered me to be his TA next year!"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\final video screenshot.JPG", "gallery_alt": "A screenshot of a carton man holding a starbucks cup in front of some trash cans", "gallery_reflection":"One of the classes that I took this quarter was INFO 360, design principles. I found this really interesting because I learned a lot about design - things like visual hierarchy or just even what font and color choices were the most accessible. As part of this class I actually designed a non app or website solution which is not something that is very common for a lot of info classes. I was very proud of my group's solution which was like a machine learning algorithm that would detect what type of trash you had and would tell you which been to put it in."},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\github contributions project 2.JPG", "gallery_alt": "A screenshot of my GitHub contributions for info 340", "gallery_reflection":"Another class that I took this quarter was INFO 340 -client side development. I actually really enjoyed this class because it showed me how to use technologies like HTML CSS and JavaScript to create functional websites and it also introduced me to Frameworks like React. I really liked learning more about front end development and I'd like to be able to work in this area in the future"}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\Harki and me in Redmond.jpg", "gallery_alt": "Roshni and Harkiran taking a selfie in Redmond downtown", "gallery_reflection":"Outside of class I also got the chance to spend a little bit more time with my friends this quarter since the pandemic was coming down. After she graduated Harkiran came to Redmond and I spent almost 7 hours taking her around Redmond downtown and taking her to like RTC and showing her my like favorite places to go it was a really fun experience for me. I hope to see her more in the future and I hope that her graduating doesn't let us slip out of touch with each other"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\Kerry_park.jpg", "gallery_alt": "Roshni sitting on a bench at Kerry park with the space needle in the back", "gallery_reflection":"Another fun thing that I did this quarter was go to Seattle downtown and explore the area with my friends we got to campus and we did a little bit of a campus tour and we got to look in all of the buildings even though they were closed after that we got some falafel from Aladdin's and then took the train to cap Hill to walk around and eat lunch at Cal Anderson Park after that we went to Cary Park which was a really fun experience and we took a lot of pictures this was really fun for me because it showed me a new part of Seattle and it was a really great time to get to know the friends that I had made this year"},
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\project 2 website screenshot.JPG", "gallery_alt": "A screenshot of the candy website I made in INFO 340 this quarter", "gallery_reflection":"Although I have taken a lot of coding classes in the past, this one was especially challenging because the structure and syntax of HTML, CSS, and JavaScript were so different than the languages I had previously learnt. I spent a lot of time in office hours, trying to get my assignments to work, and I also had to work very hard to finish the two projects that we had to do. Taking this class has exposed me to different skills that I can potentially use in the future, so I really enjoyed the work that I have done. "}, 
            {"gallery_img":"\\img\\journey\\Freshman Year\\Spring\\SATURN.jpg", "gallery_alt": "Me, tarini, sai, and nitya posing in front of the Pike Place sign", "gallery_reflection":"I could never forget spending time with Tarini, Sai and Nitya in Seattle downtown. Dressing up and walking around in the sun as college students helps me reflect on how far we have come as friends, and how much I value having them in my life. "}
        ]
    }
    
    
]