[
    {
        "Title": "AUTUMN QUARTER 2022",
        "reflection": "After attending Grace Hopper and setting up my apartment right before the school year started, getting back into classes again was both hectic and wholesome. It was hard to get out of the summer mentality of spending hours hanging out with my friends, taking long drives to the lakes, and spending every spare moment we could outside, but I’m glad I get to be back on campus with my roommates Annika and Aditi and see my school friends more often again. \nStarting this quarter meant I needed to get my head back in the game. I took INFO 300 (Research Methods), INFO 442 (Cooperative Software Development), HONORS 220 C (The Evolution of Human Behavior), and HCDE 321 (Portfolio Development Seminar). In addition to these four classes, I also was a TA for INFO 200 for the third time, and took on more of a role in WINFO as Co-President. The classes I took were academically challenging, but also fun. I learned more about the nature of people and their behavior, how to collect and analyze data, how to develop software while cross-collaborating with fellow developers and designers, and how to present myself professionally to employers. My workload this quarter was difficult to manage, but small activities like having lunch with my friends, having a picnic on the quad, and taking the time to relax and play with Mango over the weekends refreshed me and gave me the clarity and confidence to do well this quarter. \nOne of the biggest things I was a part of this year was the WINFO 11th Annual Hackathon! After some trouble with booking the HUB room, the best possible date to do it was December 3rd, which slightly threw us off because we normally do it in January. To get everything finished on time, I started to attend Hackathon Committee meetings with Emiri and Lucy so that we could plan everything out. Seeing the effort that everyone put into this event was awesome, and the past nine months of work was definitely worth it. I was so excited to stand in front of the room and host the opening ceremony with Melina and talk to participants, mentors, and sponsors. Watching the way that everyone worked together to build unique and inspiring projects that have the potential to make a difference reminded me that this is what WINFO and our team is all about. \nAlthough there were a lot of positives this quarter, there were times when the stress was too much to bear. Nobody is immune to overworking themselves and burning out. It was difficult to learn how to accept support from others and learn how to talk about things instead of bottling myself up and hiding it away. Being vulnerable is difficult - people may not understand you the first time. They might dismiss you, or just not understand your situation. However, vulnerability is a skill that can be learned. When one opens up to the right people in the right way, they can change your life for the better. I felt different as a person and as a student this quarter, as I took on more responsibilities, made more friends, and took on more of a leadership role within the iSchool. \nDespite the challenges I’ve been facing in almost every aspect of my life, I chose to view this quarter as a period of development and growth🥳Seeing the people I care about - my family, Harkiran, Gisele, Emiri, Melina, Joe, Sai, Nitya, and Vidhi made me feel incredibly supported. As we iSchool students always say, \"iSchool is my school!\"",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Junior Year\\Fall\\Mango Halloween.jpg", "gallery_alt": "A goldendoodle in a bee costume", "gallery_reflection":"When digging through my garage, I found an old Halloween costume that I then put on Mango. Doesn't he look adorable as a bee?"}, 
            {"gallery_img":"\\img\\journey\\Junior Year\\Fall\\Saint Bread.jpg", "gallery_alt": "Harkiran and I at Saint Bread", "gallery_reflection":"Harkiran visited me again in this in Fall quarter right after Grace Hopper. We visited a lot of places on campus, and she stayed for a long time. One of my favorite places was right at the edge of campus called Saint Bread, which is near Agua Verde."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Fall\\W.jpg", "gallery_alt": "Roshni on top of a giant W statue", "gallery_reflection":"Since my apartment was on the end of Memorial Way, one of the things that defined the area was the giant W that I walked across every single day on my way to class. One day I just had the urge to climb on top of the W and take a picture. It was somewhat challenging to actually climb it, but I'm glad I did. Now I can look back and say that I have a picture on top of the W! I think I will try to climb this one more time when I'm in my cap and gown."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Fall\\442 project.png", "gallery_alt": "A goldendoodle sitting on my lap while I sit in a zoom class", "gallery_reflection":"Sometimes, it's hard to find connection in online classes. One of the best ways I have seen to do this is through pets! Mango loves to have my attention."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Fall\\portfolio.png", "gallery_alt": "A screenshot of the home page of this app", "gallery_reflection":"A class that I took this quarter was HCDE 321, which was intended to build my portfolio. I used this class as an opportunity to fine tune my portfolio and add a lot of the content to it. I am really proud of the home page that I built."},
            {"gallery_img": "\\img\\journey\\Junior Year\\Fall\\WINFO Hackathon.jpg", "gallery_alt": "Roshni, Emiri, Melina, and Gisele at the WINFO Hackathon", "gallery_reflection": "This year was WINFO's first return to in-person hackathons! Emiri was our hackathon director, Melina and I were co-presidents, and Gisele was our photographer. It's really cool to see that our friend group has stayed together for this long and we still contribute to WINFO. This is a selfie that we took at the photo booth. Apparently all of my friends couldn't see me in the crowd because I was short, so they looked for me by looking for a bun :( I don't know how to feel about that..."}
        ]

    },

    {
        "Title": "WINTER QUARTER 2023",
        "reflection": "Coming into the quarter, I attended more 'surprise' birthday parties then I ever have in my life 😅. While it wasn't a bad thing, it can often be hard to find the balance between stressing out to plan the party, and taking the time to enjoy the party itself. The idea of balance has never felt more relavant than in this quarter. \nIn terms of classes, I took INFO 465, Time, Technology, and Design. Capstone, and an ENTRE class that was centered around the Grand Challenges of Engineering. I also was a TA for INFO 200, but this time with Professor Wes King instead of Joe. \n My workload was really different this quarter as well! Unlike typical tech-oriented INFO courses, this one delved into the realms of artistry and design. Our professor started the course by handing each of us a composition notebook and a box of art supplies. We worked on emphasizing experimentation over perfectionism, because we were encouraged to explore without a fear of making mistakes. In INFO 490, I finally started my Capstone project with Melina, Emiri, and Gisele. Sitting in 4 hour long classes on Friday afternoons was not my favorite way to spend my time, but I was excited about our project and I knew we would work well together! My third class, Grand Challenges of Engineering, was more like an INFO class tha anything else I had heard about in the business school. I worked on the Stanford design excercise, I worked on smaller in-class design excercises, and at the end of the quarter, I designed a resource to help improve access to birth control for students at the UW. I also worked frantically on my application for the Husky 100, as I was nominated by three people - Cynthia, Joe, and Anind. Initially, I thought I would use my honors portfolio as my application material, but then I realized that I am wayyyyyyyy over the page limit, so I decided to do an essay instead. While the portfolio didn't work out, I am glad that it gave me an opportunity to update this portfolio so that I wouldn't fall behind :))\nOutside of class, I had a much harder time finding ways to balance all of my responsibilities. One of my roommates was dealing with a lot of personal issues, and I essentially ended up becoming her only support system. While I initially was just really concerned about her and wanted to help out in any way I could, it became really difficult to manage everything all of the time. I tried to resolve this by usign official UW places for help, like SafeCampus, as well as other resources provided. \n At the same time, I was going through health challenges of my own. With chronic Bronchitis and a cough that was exacerbated by contracting covid over the summer. I spent a lot of time skipping class to go to doctor appointments, and I was finally diagnosed with asthma and a number of plant allergies that had only developed after I got COVID. While I wish they had found out what was causing these problems earlier, I am glad to finally have everything sorted out health-wise \n Navigating classes and personal things became really hard for me as the quarter went on. I started to fall behind on my work and very quickly felt overwhelmed and I felt like there was nothing I could do to get ahead. I am really thankful that I was able to reach out to my own support system, namely Sai, Harkiran, and Professor Janes, who all gave me different advice and also helped me take my mind off of things. I also spent time hanging out with my friends, like meeting Nila every Thursday in the Co-Lab to 'study' (we just talked and ate snacks most of the time), hanging out with Gargi for movie night, and checking out new places to eat on the Ave. \nHere's hoping next quarter gets better!",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\465.jpg", "gallery_alt": "A page with the words time, technology, and design written in crayon", "gallery_reflection":"One of the classes that I took this year - just for fun - was INFO  465, also known as Time, Technology, and Design. Rather than a more tech-based INFO class, this was actually more artsy and design-based. On the first day of class, our professor handed us each a composition notebook and a bunch of art supplies. All we had to do was draw, so we were encouraged to explore different mediums and different materials while not worrying about mistakes. I think this is a really interesting way of approaching design because a lot of times people put an emphasis on perfectionism rather than the act of creation. Trying is always necessary before you get any better and one thing that I did notice was that at the end of the quarter, my drawings were actually a lot more cohesive and they felt a lot more put together even though I was using the same process as I was at the start of the quarter."}, 
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\Capstone.jpeg", "gallery_alt": "me, emiri and gisele looking sad at the camera while melina smiles", "gallery_reflection":"My Capstone team was comprised of myself, Melina, Emiri, and Gisele. We called ourselves iBANT which is also the abbreviation of our group chat which is named (I'm bad at naming things). I don't know how the name of our group chat stuck but it's kind of funny to see that it has stuck long enough to become our capstone project's name. This picture was taken when we all decided that we were bored and tired of sitting in 4 hour long Capstone class and we took a picture just to show how bored and done we were. I don't think Melina got the memo lol."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\Penny in the fountain.jpg", "gallery_alt": "a group of senior citizens smiling and throwing pennies into drumheller fountain", "gallery_reflection":"I took a class called Grand Challenges of Engineering and I initially assumed that it would be teaching us about engineering business models. Our final project was similar to that, but before we got there we actually had a smaller project where the professor gave each group $5 and we had to create the most impact with it. We could define impact in any way we wanted and we just had to create as much impact as possible. My group decided to turn those $5 into 500 pennies and we handed out the pennies to people around campus so that they could flip the coins into the fountain and make a wish. This is a picture of a senior walking group that we came across that was really excited to flip the coins into the fountain and they even let us take a picture of them."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\portland.jpg", "gallery_alt": "Vidhi, Pamela, and I taking a selfie in Portland", "gallery_reflection":"This quarter I also took my first trip with my friends and without my parents. Vidhi, Pamela and I went to Portland by bus and we stayed for the long weekend. The first day, we woke up really early and we took the bus from International District and then made the long ride all the way to Portland. Once we got to Portland, we were able to check into our hotel and then we just walked around until we got hungry, ate some food and then explored the downtown area. The second day we went to Multnomah Falls and did a little bit of a hike. We took some more pictures and then came back for more food and more shopping. I hope I get to do more solo trips or trips with my friends in the future!"}, 
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\red square.jpg", "gallery_alt": "A pretty picture of Red Square", "gallery_reflection":"Sometimes, it's hard to find the beauty around us. Even in dark gloomy days for most of winter quarter, it was nice to finally look up and see some sun :)"},
            {"gallery_img":"\\img\\journey\\Junior Year\\Winter\\surprise party.jpg", "gallery_alt": "Tarini and I cutting cake on our 21st", "gallery_reflection":"This year has to be the year of surprise parties. All of my friends turned 21 at around the same time and obviously all of us had to have our own surprise parties. With one birthday being on December 29th, the next one being on January 2nd, the following being on January 4th, and then one after on January 8th, the parties just seemed to keep piling on and on and on. We were planning surprise parties during other parties and all of them turned out well. This picture was taken on mine and Tarini's 21st birthday! Vidhi and Sameera took us to Din Tai Fung where we had dinner and then on the way back, we were surprised because everyone was in my apartment with cake and decorations."}
        ]

    }, 
    
    
    {
        "Title": "SPRING QUARTER 2023",
        "reflection": "With the end of this quarter, I can finally say I'm done with my INFO degree! I took all of my required classes, and presented my capstone project, so all I have left to complete are a few honors requirements and classes for my minor. \nI started the quarter with a haircut from Gene Jaurez salon, and I have to say, I have never felt letter about cutting my hair - maybe ever! While it was a little pricy, I loved the way they made layers and really helped my curls pop. I thought of it as a little treat to congratulate myself on getting through last quarter. In reaching out to all of my support systems over last quarter and this quarter, even the ones from on campus, I realized that I was overextending myself. While it is usually a good thing to try to be empathetic and caring, the biggest thing that I learned over the course of this quarter was that I should not be prioritizing others over my own care because I simply cannot pour from an empty cup. Finding the balance between meeting my moral obligation to care for my friends, and the physical requirements to care for myself before I get burnt out was a hard lesson to learn, but necessary anyway. \nIn terms of classes, this quarter I took INFO 491 (Capstone part 2), INFO 498 (cultural Analytics), ESRM 426 (Wildland Hydrology) and Honors 222 (Natural History and Culture Museums). While 4 classes was a lot, I really enjoyed taking all of them. I felt like each of these classes excercised a different part of my brain, and the overlap was also something I learned from. \nComing into INFO 498, I had no idea what cultural analytics even was. However, I was pleasantly surprised by how much fun I had in learning how to use PANDAS and collecting data from seemingly random places. \nWildland Hydrology was my first class after declaring the ESRM minor, and it was well outside my comfort zone. I learned so much about excel, and even relearned basic physics, which I have not taken since high school. I think i would not have dorrwn through thus class without the support of my peers in my study group - because this was the first time I had to take use a study group to verify whether I was actually using the equations correctly or not! Suffice to say I struggled a lot  - but it was surprisingly fun. \nHonors 222 was also a really interesting class. It met inside the Burke Museum, and we got to tour the different collections and exhibits and learn how they work. One of my favorite parts of class was touring the paleontology collection and being able to touch real dinosaur fossils! I also really liked looking through the cultural exhibits and learnign about the Native peoples who made their homes in this part of Washington. \nI think when the sun is out in Seattle, everyone automatically feels a lot happier. The days are getting longer, we have gorgeous cherry blossoms, and we don't have to lug around jackets or umbrellas anymore. To me, spring embodies a both energy and joy - something I think I really needed. Taking all of these classes + capstone while also spending more time focusing on myself, and starting music again has given me a greater appreciation for the role that balance plays in my life. Since I have finally started to take more time for the things that I enjoy, I feel more like myself and I am able to produce better quality work, and be a happier person. ",
        "gallery": [
    
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\Dean club dinner.jpeg", "gallery_alt": "Me, Kayla, and Bandhna at the Dean's club dinner", "gallery_reflection":"This year, for the Dean's Club Dinner, I was not invited as part of WINFO! Instead, I was invited as part of the Husky 100, and my role was to sit at a table and present an award to the donors. At my table I talked to Brittney Hoy, who was also a past WINFO Officer!"},
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\Fossil.jpg", "gallery_alt": "A fossil on the wall of the Burke Museum", "gallery_reflection":"I took an Honors class this quarter called 'Natural History and Culture Museums, the Story of the Burke' and it was taught inside the Burke Museum! I loved getting to go inside all of the collections and seeing everything they had behind the scenes. Polly and Melissa were also super friendly professors and were so passionate about their teaching. My favorite part of this class was being able to touch actual dinosaur fossils from the collections, like a hadrosaur."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\Graduation.jpg", "gallery_alt": "Melina, Emiri, and Gisele graduating", "gallery_reflection":"All good things come to an end - but not always. At the end of this quarter, my INFO friends all graduated, leaving me to stay for another year. I am so proud of them for everything they accomplished, and I am so happy that they were a part of my college life! I know that our friendship will continue. Team iBANT forever!"},
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\Husky 100.jpg", "gallery_alt": "A goldendoodle sleeping on a bed", "gallery_reflection":"One of the biggest awards I have recieved was the Husky 100 award in 2023. I was really proud of the work I put into the application, and also the work I did both as a TA and with WINFO. I was also really glad to see that a number of my friends, including Duaa, won as well! My favorite part of the whole experience was getting to meet Dubs, and the liquid nitrogen ice cream they had at the ceremony."}, 
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\team iBANT.jpeg", "gallery_alt": "Sketched versions of Melina, Emiri, Me, and Gisele", "gallery_reflection":"We presented our capstone project this quarter! It's been really cool to learn more about React Native and finally see the finished product come to life. We let our capstone project become open-sourced so that next year, some other team could take it on."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\python.png", "gallery_alt": "A graph showing the revenue difference between English and non-English films", "gallery_reflection":"I took a special topics class with Melanie Walsh to learn about cultural analytics and see how we could collect data from everyday things like Reddit posts, and use that in data analysis. For our final project, my group collected data on movie earnings in films across different languages, and compared that to English language films."},
            {"gallery_img":"\\img\\journey\\Junior Year\\Spring\\hydrology.png", "gallery_alt": "A homework problem to calculate runoff", "gallery_reflection":"This quarter, I took a class called Wildland Hydrology as part of my minor in Environmental Science and Terrestrial Resource Management. To be honest, this class was one that I struggled with a lot, and I don't think I would have made it without working with my study group on the problem sets. I was really proud of myself when I got a 96% on the final! While this was not a tech-heavy class, I learned a lot more about how to use Excel."}
        ]

    }, 
    {
        "Title": "SUMMER QUARTER 2021",
        "reflection": "This summer I returned to Amazon (but with a different team) as an SDE intern! This time, I worked with the CloudFront Edge Compute Team, which was a massive change from my previous time working with the Adaptive Transportation Services. During this internship, I started off my having to learn an entirely new programming language - Rust, and it proved to be both demanding and immensely gratifying. I spend most of the first six weeks of my internship with a pen and a notepad, taking notes on the Rust principles and Syntaxm while also learning how EdgeCompute worked. I have to say that working at AWS was really fun, and a very different style of programming than I was used to. \nOne of the most rewarding aspects of my internship was the opportunity to tackle real-world problems and make tangible contributions to the team's projects. I knew that whatever project I worked on would create real impact for the team and the customers. My goal was to optimize the execution time of a service that my team worked on. To accomplish this, I spend hours designing and debugging a brand new data structure, which I then implemented within the existing codebase. \nThis was challenging for me because some of the files were written in different languages. While most of the files I modified were in Rust, I had to change a few files written in C, and use the C-API correctly to do so. I started out really worried to talk to my mentor and my other teammates, but I soon learned that they were there to help me succeed and they would answer all of the questions they could \nAt the end of my time there, I was proud of the code I wrote. By performing a load test on my code, I knew that it was capable of handling a staggering 8 billion requests per second. I also met my project goal, and contributed to a 150% decrease in the execution time of the service I was working on!\nOne of the reasons I enjoyed this internship so much was because, I was fortunate to make more friends and work alongside another intern. More than anything, I appreciated their companionship and being able to take breaks and grab coffee together made me feel more connected to my team. ",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Junior Year\\Summer\\Music.jpg", "gallery_alt": "Roshni performing in California", "gallery_reflection":"A few months ago, I finally restarted Music classes as a mother's day gift to my mom. I did this by learning 9 Annamacharya krithis and participating in a performace over the summer! It was a hectic day because I flew to California at 6 in the morning with my mom, and then flew back at 9pm. The performance was at 5 pm and I think we did pretty good overall. I really enjoyed singing and I think I will continue my lessons. "},
            {"gallery_img":"\\img\\journey\\Junior Year\\Summer\\Spheres.jpg", "gallery_alt": "A view of the Spheres from outside my window", "gallery_reflection":"This summer for my internship I switched teams and worked in the Seattle office instead of in Bellevue. I had a much better experience, and I loved going into the office. I feel like I was able to make a lot more friends and I had a gorgeous view from outside the window near my desk!"},
            {"gallery_img":"\\img\\journey\\Junior Year\\Summer\\Superstar Rajini.jpg", "gallery_alt": "A movie screen saying Super Star Rajini", "gallery_reflection":"One of my favorite activities to do with my mom is to watch Tamil masala movies, where there is a hero that wins a lot and defies the laws of physics. To me, the plot is often less relevant than the idea of going to the movies and enjoying the time I spend with family. "}
           
        ]

    }
    
    
]