[
    {
        "Title": "AUTUMN QUARTER 2023",
        "reflection": "More of my adventures coming soon!",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Senior Year\\Fall\\big4.jpg", "gallery_alt": "Roshni in front of the Big 4 Ice Caves", "gallery_reflection":"This quarter, I took a class called National Parks and Recreation, and one of the fun things we did was take a trip to the Big 4 Ice Caves! It was freezing most of the time, but I learned a lot about wildlife management. Even though there are multiple signs posted about the danger of going into the caves, people still go into the caves anyway because they are naturally curious. One of my favorite parts of this trip was when we toured the ranger station and I got to be airlifted into a helicopter!"}, 
            {"gallery_img":"\\img\\journey\\Senior Year\\Fall\\Camping in Yakama.jpg", "gallery_alt": "A tent I built by myself", "gallery_reflection":"I took a field trip to the Yakama Valley to learn about the culture and history of the Yakama nation, as well as to experience the culture of the tribe. This was such a great experience for me, and I found so many similarities and differences between the cultures that I am part of, and the culture that was shared with me through this field trip. I left with a profound insight on how we are all tied to nature, and how cycles of life need to be protected so that all of us can thrive. One thing that I was especially proud of was pitching my own tent!"},
            {"gallery_img":"\\img\\journey\\Senior Year\\Fall\\India.jpg", "gallery_alt": "Me and Tarini wearing a sari that our cousin bought for us", "gallery_reflection":"Over winter break, My family and I went to India for my Uncle's 60th birthday! It was a short trip - we only went for three weeks, but the weather was a welcome change. We spent a lot of time exploring different places in Chennai with our cousin, and while the trip was hectic, it was still a lot of fun. This picture is from when Tarini and I were wearing saris and distributed kalkandu"},
            {"gallery_img":"\\img\\journey\\Senior Year\\Fall\\Info wall.jpeg", "gallery_alt": "A picture of me on the wall of Mary Gates Hall", "gallery_reflection":"Last year, I won the Husky 100, and to my surprise, I walked into the 4th floor of Mary Gates and I saw my face on the wall (lmaoo). While I wish I had picked a better picture of me, it was still a nice surprise."},
            {"gallery_img":"\\img\\journey\\Senior Year\\Fall\\Night Carnival.jpeg", "gallery_alt": "I attended the night carnival and took a photo at the booth", "gallery_reflection":"Before the school year started, I stopped by the UW Night Carnival after work to have fun and see the booths! I really wanted to get a wax hand, and I did! It didn't last very long, but it was still a fun experience"},
            {"gallery_img": "\\img\\journey\\Senior Year\\Fall\\Polaroid photos.jpg", "gallery_alt": "polaroid photos of me and sai", "gallery_reflection": "This year, I also got a polaroid camera and I want to use it to take photos of my favorite memories, so that they can last a lifetime :))"},
            {"gallery_img": "\\img\\journey\\Senior Year\\Fall\\roommates minus sai.jpg", "gallery_alt": "My friends and I on our way to Garba", "gallery_reflection": "This is most of our roommate team (plus Vidhi, minus Sai) We all got dressed up and went to Garba, which was a lot of fun. I love the lehenga I am wearing because it is so light and it is such a beautiful design. Garba was also really fun, but I liked it better than last year. I think this will be one of the last South Asian RSO events I will go to - maily because I have more fun hanging out with my friends instead of the actual event. "},
            {"gallery_img": "\\img\\journey\\Senior Year\\Fall\\TA.jpg", "gallery_alt": "Nila and I in the sun in Gowen Hall", "gallery_reflection": "This was also my first quarter being the lead TA for INFO 200. One of the most significant aspects of being the Lead TA has been the opportunity to serve as a mentor for my peers. Starting in Fall, we had a lot of new TAs join our teaching team, and it was often my job to show them how labs worked, and what to do during lab. I am really glad to have Nila be a TA alongside me, and I felt like our friendship has grown so much. Here we are sitting in the sun in Gowen."},
            {"gallery_img": "\\img\\journey\\Senior Year\\Fall\\WINFO Bonding.jpg", "gallery_alt": "The WINFO Officers", "gallery_reflection": "There is not enough space in the world for me to talk about WINFO. I am so happy we got to have more bondings, and I am so incredibly proud of this team. I have no words 🥺"},
            {"gallery_img": "\\img\\journey\\Senior Year\\Fall\\WInfo.jpg", "gallery_alt": "an instagram flyer for iSquad bonding", "gallery_reflection": "This was one of the highest attended events that I have ever been to! We organized a meetup at Boba Gem on the Ave, and then led everyone to the quad to play games. I met a lot of super amazing people, and some of them even joined WINFO later!"}
        ]

    },

    {
        "Title": "WINTER QUARTER 2024",
        "reflection": "More of my adventures coming soon!",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Senior Year\\Winter\\Discovery Park.jpg", "gallery_alt": "Baloo and Mango in Discovery Park", "gallery_reflection":"This time of year was a lot of firsts for me! I drove to Discovery park with Nitya and Sai (and 2 dogs) across the bridge. While I have been driving for a while, this was the first time I have driven across the bridge. To say it was an eventful day would be understating it. We drove through rain, then hail, a Montlake closure, and missed our exit 3 times on i5. But now that I've done it once, I am so much more confident in my driving."}, 
            {"gallery_img":"\\img\\journey\\Senior Year\\Winter\\Food account.jpg", "gallery_alt": "Rice cakes with broccoli tofu and basil", "gallery_reflection":"If there's one thing I love more than anything else, it's food. I created a food instagram account this year to document my Journey with food! "},
            {"gallery_img":"\\img\\journey\\Senior Year\\Winter\\WINFO Hackathon.jpg", "gallery_alt": "All of the WINFO officers at the hackathon", "gallery_reflection":"With my last quarter also comes my last hackathon. I was much more involved this year as president and I am so happy with the way the hackathon came together! I cannot be more proud to have worked with the officers who made this event possible."}
        ]

    }, 
    
    
    {
        "Title": "SPRING QUARTER 2024",
        "reflection": "While I won't be in school this quarter, more of my adventures will be coming soon!",
        "gallery": []
    }
    
    
]