[
    {
        "Title": "AUTUMN QUARTER 2021",
        "reflection": "My first quarter in person! From going dorm shopping, eating Local Point (ugh) and on the Ave, attending in-person classes, and catching the bus on weekends, this quarter has been hectic but eventful. Annika and Vidhi are the perfect combination of roommates (even if our moms send us too much food) While it has been stressful, I have been able to build new relationships, make more friends, and get a more full experience of the ‘college life.’ \nI actually started my work for the school year way back over the summer, as Gisele, Pranav, Cynthia and I met over the summer to work on the FearLess, Tech More Innovation Challenge. We scheduled meetings to build a curriculum for the one-week virtual hackathon, which we ran in November of this year. As part of the preparation, I recorded videos on prototyping and wireframing, introducing these concepts to the participants. The hackathon itself went really well, as we had close to 11 teams participate, and selected 2 teams as winners. Both teams did an amazing job and everyone was very impressed by the quality of their work. I also had multiple students reach out to me to ask about informatics direct admissions after the event. As we got closer to starting the school year, I already knew this was going to be one of the best quarters of my life. I knew this quarter was going to be hybrid, and I knew I had to not only take care of myself but also continue to build on the friendships I made last year while also performing well in my classes. \nOutside of class, one of the highlights of each week was eating lunch with Melina, Gisele, and Emiri, as well as video calling Harkiran when I could. Creating interactions with my friends helped me take a break from my classes and catch up with the people close to me. With regard to my coursework, I took INFO 102 (Gender and Information Technology), INFO 270 (Data Reasoning in a Digital World), and CSE 373 (Data Structures and Algorithms). I chose these classes because I wanted to explore different aspects of information technology while also getting the hang of in-person learning. \nI also served as a TA for INFO 200 for the first time this quarter, under Joe Janes, and I had an amazing experience. My responsibilities were to attend lectures, grade projects, and teach lab sections. At first, I was intimidated by my students, as I was scared of making mistakes. However, after gaining experience by teaching classes and observing the other TAs, I was much more confident in my abilities as a TA by the end of the quarter. I think the biggest takeaway I had from this experience was to set boundaries with my students when they can come to me for last-minute extensions or advice, and to consider the situations they are in so I can best adjust to everyone’s needs, and I intend to work more on this next quarter. \nI thought this quarter was a great learning experience in terms of living (partially) by myself, and learning how to balance new situations as they come up. On a more personal note, this quarter has taught me, more than ever, about the importance of maintaining a balance both in school and in personal life. With everything going on, it can be hard to remember that you are not alone in whatever you do. Mental health is one of the most important things you can take care of, and the things that happened over this quarter and this break have made that abundantly clear. \nRest in peace, Aravind 💜",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\bianca screenshot.png", "gallery_alt": "An email from one of my students this quarter", "gallery_reflection":"I started sophomore year as a TA for INFO 200 for the first time! I had a lot of anxiety going into it because I did not know if i would be a good TA or not. This artifact shows me that despite my own anxieties, others can't usually see them. My students really appreciated the work that I did because I spent a lot of time and effort providing feedback, and I tried to be the nicest TA I possibly could. Receiving this email actually made me feel a lot like my students actually cared about me and has given me the biggest boost in confidence that I could ask for."}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\BS Inventory.png", "gallery_alt": "A drawing of several flowers acting as a BS inventory", "gallery_reflection":"​This quarter I took INFO 270 which is also known as calling BS. This artifact is an inventory of the BS I have produced over the first few weeks, whether the BS is in the assignments I've turned in or things that I have told my friends, or even the things that I used as an excuse. I really enjoyed taking this class and it helped open my eyes to the staggering amounts of BS that are present in our daily lives, particulatly in the form of misinformation, and how quickly it spreads. "},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\CSE 373 Mind Map .png", "gallery_alt": "A map showing how different CS concepts, like algorithms, are related.", "gallery_reflection":"This quarter I took CSE 373.I actually had a lot of fun in this class, despite the stories I had heard about it. I enjoyed taking this because I got to learn more about data structures and I felt a lot more confident in doing interviews and learning about algorithms like dijkstra's or trees and graphs. One of the most interesting things about this class was that my final was actually a blog post rather than an exam or a test so this is a screenshot of my mind map where I'm linking all of the concepts that we learned to show how they are related to each other."},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\FearLess 1.png", "gallery_alt": "A poster saying Fearless Innovation Challenge", "gallery_reflection":"Outside of class, I took more responsibility as the Director of Diversity for WINFO and one of the biggest things I did was work with Gisele to pull off the Fearless Tech More Innovation Challenge. This is a screenshot of the flyer that we made and it was actually really successful! we had around 35 students come into the hackathon and create a lot of really amazing projects"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\cap_hill_gisele.jpg", "gallery_alt": "Two people sitting on a bench", "gallery_reflection":"Since it was my first quarter on campus, I tried to explore a little bit more around campus and even Seattle. I went to Capitol Hill and I visited Gisele where they work and I took a picture with them in front of Sweet Alchemy. I hope to continue exploring more places and making the most of my in-person experience! "}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\football.jpeg", "gallery_alt": "Me and Annika taking a selfie at a UW Football Game", "gallery_reflection":"I also did a lot of other college-student-like activities like participating in student events. One of my favorites this year was going to the UW football game with Annika. We left at the end of regulation but the game actually went into overtime so we watched the rest of the game on my phone because it ended after 10:00 p.m. "},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Fall\\imposter syndrome2.jpg", "gallery_alt": "A paper with a lot of Mario Kart stickers", "gallery_reflection":"This quarter, I also led the Diversity committee in creating the Imposter Syndrome Power Hour. We gave everyone stickers that were Mario Kart themed and we had them make a map of their own imposter syndrome. While asking them to reflect on how their imposter syndrome was affecting them. This is a picture of mine. I put in Princess Peach and her friends to represent me and my friends and I put in some cannonballs to show that support from friends and family will help me get over my insecurities and my imposter syndrome about being indecisive. "}
            
        ]
    },

    {
        "Title": "WINTER QUARTER 2022",
        "reflection": "This quarter has been a whirlwind of new experiences and accomplishments for me. As I started thinking about what I wanted to accomplish, I found myself seeking new experiences that would broaden my horizons and allow me to meet new people that I had not had the opportunity to interact with before. Key among this was my participation within the iMentorship program run by Professor Laura Schildkraut. I was paired with a mentor named Rosemary, who I learned that I had a lot in common with! I learned that Rosemary was the Director of Diversity efforts for IUGA during her time at the iSchool, and she had a wide variety of experience in the field working for different companies. I found value in this program by being able to learn from someone who has already established themselves in the field and I even invited Rosemary to attend the INFO 200 alumni panel, where all of the students truly loved hearing about her experience. By learning from Rosemary, I was introduced to a new professional route I could explore - UX Engineering - where I could work at the intersection of design and programming, combining my love for development with my passion for creating experiences people enjoy. \nWith regards to my classes this quarter, I took HONORS 394A (Ways of Feeling) with Duaa, where I was able to build the vocabulary to talk about the way different cultures use words to express emotions, and how some emotions are present only within certain cultures. This interested me a lot because I was able to see how similar cultural backgrounds used words differently to express emotions. I also took STAT 221 and INFO 380, which have been incredibly valuable for me to learn the technical skills that I need to succeed as someone in the information field. Furthermore, I continued to be a TA for INFO 200, which has been a great opportunity for me to give back to the community and help guide new students in the program. I felt like I was able to offer more advice to my students this time around, sometimes editing essays for prospective informatics students. \nOutside of class, I continued to work with Cynthia to develop the iTech Modules project, which was part of an OMAD seed grant built to help expose middle and high school students to STEM topics through bite-sized modules. Working with the Diversity Committee and Cynthia has allowed me to build my own style of leadership and bring forward new ideas to expand STEM outreach. Of course, none of the things I was able to accomplish this year would have been possible without the support and guidance I received from the original WINFO Diversity Committee. In mid-January, I also had the opportunity to see the original Diversity committee in-person at Sweet Alchemy! It was a surprise for some people, and ended up being an amazing way to reconnect with the people who shaped my first year at the UW. WINFO has been such a large part of my experience at UW, so for me, the next step forward was to run as Co-President of WINFO, and at the end of the quarter, I was elected as one of the Co-President along with Melina! I have absolutely loved my time within the informatics program thus far, and I hope to continue to contribute to this amazing community as I begin to serve in this new position. ",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\azure.png", "gallery_alt": "A screenshot of my DevOps storyboard", "gallery_reflection":"This quarter, one of the classes that I took was INFO 380 also known as the Azure DevOps class. I think this class was really important for me to learn about because I learned how to use Azure and I also learned about normal software development practices like AGILE. While I had a lot of struggles understanding what was going on in my class, I can say that I learned a lot and I came to the realization that my grade in the class is not always as important as my learning. I am not proud to say that I received a 70% on my final, which was almost unheard of for me(:0) Despite the setbacks, I am proud of how I did not take my grade to heart and I was able to keep my head high. "}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\glossier.jpg", "gallery_alt": "Looking at myself in the mirror", "gallery_reflection":"In my last quarter as director of diversity one of the my favorite things that I organized was a diversity committee bonding where we went around to Capitol Hill. We went to Glossier, ate some Ramen, and also visited a cat bookstore. This picture is me taking a mirror selfie in Glossier because it was my first time there "},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\hackathon.jpeg", "gallery_alt": "A screenshot of the Remo tables at the WINFO Hackathon", "gallery_reflection":"Although I was not directly involved with planning the Hackathon this quarter, I spent a lot of time with Emiri and Melina and heard about it from their perspective. Seeing all of the things that happened behind the scenes really showed me how much work and effort goes into this event. Due to the fact that we had a hybrid quarter we had to change our hackathon from an in-person to a virtual one, and that took a lot of effort and a lot of last-minute  struggles. I'm really proud of Sharon and Melina and Emiri for planning such an amazing hackathon and I had a lot of fun working as an officer!"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\Roshni_president.png", "gallery_alt": "A screenshot of an instagram post stating that I had won the election!", "gallery_reflection":"I spent a lot of time over the past few years working with WINFO officers and being a part of the RSO. I felt like a lot more confident in my abilities to contribute to the amazing iSchool community, so I decided to run for president. I was so happy to see that I had gotten the role and that I would have the opportunity to work alongside Melina as my co-president."},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\ta lunch.jpeg", "gallery_alt": "The INFO 200 TAs eating lunch!", "gallery_reflection":"I also spent a lot of time bonding with the other Tas that I worked with. This picture is from the end of the quarter lunch that Joe organized at Cafe on the Ave. I learned a lot from these TAs, and I am really sad that some of them are graduating!"}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Winter\\waterfront.png", "gallery_alt": "Harkiran and I at the waterfront", "gallery_reflection":"This is a picture of me and Harkiran at the Waterfront in front of Fisheries. This was the first time I have seen her in person since last year when she came to Redmond. Seeing each other in person helped me reflect on how much I have grown as a person, and how much my life has changed in the span of one year. I have accepted that I am a queer desi woman, and that isn't going to change. We had a lot of fun and we went to a lot of different places that I never would have gone to otherwise: like the waterfront and Agua Verde, as well as other places off campus like Capitol Hill and hotcakes and the Spheres "}
        ]

    }, 
    
    
    {
        "Title": "SPRING QUARTER 2022",
        "reflection": "Spring Quarter on the UW campus always feels exciting. Whether it is because of the thousands of people visiting the cherry blossoms, the newly admitted students visiting campus for the first time, or students finishing up their classes and enjoying the sun, the energy around campus just feels more exciting. I was able to get a firsthand taste of that energy as a panelist at Admitted Student Preview Day over spring break, where I answered questions posed by newly admitted students and talked about my experiences at the iSchool. I was also able to continue my work from past quarters by further developing the iTech Modules event, which was finally launched! We were able to host a mini lecture by Professor Joe Janes, and teach two modules on web development and cybersecurity. The event was a huge success, and it was incredibly fun to see the interest students had about informatics. I also had the amazing opportunity to present my journey through the iSchool in front of the UW Foundation Board. I met a number of inspiring people, including the CEO of AWS, and was also able to talk about how I came to join the iSchool and the impact I have tried to make within it. I’m really grateful to Cynthia for helping to write the speech and practice it every week. Melina and I worked a lot this quarter to determine how best to run WINFO. We decided that I would be the internal president, and she would be the external president. On my part, this meant that I attended SLC meetings, hackathon meetings, and facilitated the officer meetings as well. Additionally, Melina and I were invited to attend the annual Dean’s Club Dinner, where we met with a number of inspiring alumni of the iSchool! In addition to my involvement in WINFO, I also took CSE 414 (Databases and SQL), HONORS 212 C (Comic Books in the Middle East) and SOC 225 (Data and Society) which were all challenging and engaging courses, providing me with a wealth of knowledge and skills in a variety of fields. Although I was not a TA for INFO 200 this quarter, I put it on myself to take on new responsibilities while also having fun along the way :) One of the social events I attended this quarter was iCruise, held by IUGA (Informatics Undergraduate Association). It was a fun and eye-opening experience, where I got to socialize with a number of other informatics students, and take in the sunset views from the middle of Lake Washington! Overall, this quarter has been an incredibly valuable and rewarding experience, filled with learning, growth, and impact. I am excited to see where these experiences will lead me in the future and I am looking forward to continuing to push myself and strive for excellence in all my endeavors.",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\cse 414.jpg", "gallery_alt": "Notes showing table joins", "gallery_reflection":"One of the hardest classes that I've ever taken at UW was CSE 414 where we learned SQL and how to use databases. I took this class with Emiri and honestly she pulled me through this class! I had a really hard time learning the different notations, especially for joins and other ways of combining databases. While it was one of the hardest classes that I've taken, it was honestly really valuable."}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\dean club dinner.jpeg", "gallery_alt": "Melina and I with Anind and Amy", "gallery_reflection":"At the end of spring quarter I was invited to attend the Dean's Club dinner where I was able to talk to different iSchool donors and alumni and network with them. One of my roles was to tell them about my role in WINFO, as well as all of the amazing things that WINFO does. One of the things that officers did for preparation for this event was right thank you cards to all of the donors. It was really funny to see that some of the people had gotten cards that I wrote :)"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\dorm_dinner.jpg", "gallery_alt": "Thai food takeout on the floor of my dorm", "gallery_reflection":"I also took it upon myself to spend more time with my roommates. Vidhi and I planned a lot more dinners where we just bought takeout and then ate it all together in the dorms. This was a really great way for me to socialize with my roommates and also try a lot more places on the Ave. One of the places that I really liked was Jai Thai because it has these tiny little spring rolls that are really good"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\founders speech.jpeg", "gallery_alt": "A picture with Adam Selipski, the AWS CEO", "gallery_reflection":"Due to my work with iSchool diversity, Cynthia invited me to present to the UW founding board about my experience coming into the high school as a freshman direct admit. In my speech, I mentioned that I read Harkiran's post on the 'I am the iSchool' page, and that helped me apply. I also shared that I am on the page now as well. One of the really cool things about this presentation was getting to meet Adam Selipski, one of the CEOs of AWS"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\graduation volunteer.jpeg", "gallery_alt": "Melina and I volunteering at graduation", "gallery_reflection":"At the end of the quarter I volunteered as a an usher for convocation. I was with Melina and I got to watch some of my friends walk down the pathway and get their diplomas. I was also able to see what the experience would be like for me a few years down the line and look forward to the experience."}, 
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\iCruise.jpeg", "gallery_alt": "WINFO Officers at iCruise", "gallery_reflection":"What could be better than getting on a boat with 150 other people? This quarter, Melina and I got tickets to iCruise, which was an interesting experience - to say the least. The boat took around 3 hours to go around lake Washington but the views were stunning!"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Spring\\tarini_cherry_blossoms.jpg", "gallery_alt": "Tarini carriying me in front of the cherry blossoms", "gallery_reflection":"What was Spring quarter be without cherry blossoms? This year, during admitted student preview day - my friends and my sister came to campus and we were able to take photos of the beautiful cherry blossoms. This is my first time seeing the cherry blossoms in person because I had never come to campus during spring before this despite having lived in Seattle for almost 11 years."}
        ]

    }, 
    {
        "Title": "SUMMER QUARTER 2021",
        "reflection": "I selected this engagement as a way to help me break into the software industry and learn the skills I need to succeed in the workplace. I am passionate about learning new skills, and this opportunity allows me to take the skills I have learned in my classes (like CSE 414) and apply them directly to a real-world project at one of the largest companies globally. \nI hoped to gain both networking skills and the skills to solve problems effectively in a group workplace. One of the defining characteristics of an internship at Amazon is that I will have complete ownership of my project from start to finish.\n I believe this embodies the Experiential learning category of leadership because I must envision the solution to the problem my team is facing and implement it by taking ownership of how the process is completed and what existing tools to use in order to make sure it is feasible to use for any developers. While I will be taking ownership of the project, leadership does not mean that I will work alone. Throughout this internship, I will be collaborating and checking in with my mentors and managers to listen to their feedback to guide my project, as well as seeking advice from fellow interns. \nDuring this internship, I was able to build my skills in a variety of different areas, including learning about frameworks like the ELK stack and using Linux to navigate through the package file systems. In addition, I also learned how to use systems like the AWS console, and within that, I learned about tools and services like OpenSearch, Lambda, IAM, and API Dashboard to help me implement features within my project. Finally, I was able to learn about how Amazon works and understand the organization behind pipelines and the services on the ATROPS team. \n The Service Log LookUp Gizmo (SLLUG), is a tool meant to send logs to be parsed, indexed and stored whenever each line is created in order to decrease time taken to query logs through the implementation of an ELK stack. The primary deliverable for this project was the implementation of a log listener running on all hosts, able to be searched and visualized in Kibana. The success criteria for my project was that the logs should be received in under 1 minute, be able to be queried by search string or proposal id, be able to be filtered by timestamp, service, and region, and be stored and easily accessible for 3 months. I was able to meet these deliverables by creating a package with a set of files to run RiverPig and logstash, setting up and running the OpenSearch Dashboard, and writing two lambda functions to enable creation and deletion of indices and logs. \nDuring my midpoint review, some of the feedback I received was to be more vocal when I needed help so that I would not be stuck for as long on the issues I was facing. In order to apply this feedback, I gave myself a timer of 2 hours to try and solve the problem I was having, and If I was not able to find an answer in that time frame, I messaged my mentor and onboarding buddy to see if they could help me. I found that after implementing this method, I was able to move much faster through the process. \nOver the course of my internship, I ran into a variety of ambiguous situations. The first of which was within the first few weeks of my project, where I was not able to access the OpenSearch Dashboard due to issues with the AWS creation. Because this was so early during my project, I was not really sure what to do, and spent a while reading documentation on builderhub and the wiki pages to help. However, these pages were not as useful because I could not find the specific issue. I adapted to this by changing my approach and looking at sage to start my deep dive, as well as asking my mentor and onboarding buddy about my issue so that they could help me work through it. Overall, this project has taught me a lot about how Amazon works, and has taught me some of the skills I need in order to be a successful software engineer in the future.",
        "gallery": [
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Summer\\Amazon escape room.jpg", "gallery_alt": "My team at Amazon after finishing an escape room", "gallery_reflection":"I did an internship at Amazon! It was honestly a really challenging experience - I spent weeks tryng to set up my laptop with the right systems, and I also had to change my project partially through the internship! Despite this, I grew to be a lot more confident in my ability as a software engineer. My work over the summer was mostly hybrid, but I really liked going into the office every day. (Not just for the free barista drinks) One of my favorite parts of the internship was meeting the other interns and other team members to do an escape room!"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Summer\\Baloo.jpg", "gallery_alt": "My team at Amazon after finishing an escape room", "gallery_reflection":"I did an internship at Amazon! It was honestly a really challenging experience - I spent weeks tryng to set up my laptop with the right systems, and I also had to change my project partially through the internship! Despite this, I grew to be a lot more confident in my ability as a software engineer. My work over the summer was mostly hybrid, but I really liked going into the office every day. (Not just for the free barista drinks) One of my favorite parts of the internship was meeting the other interns and other team members to do an escape room!"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Summer\\Grace Hopper.jpg", "gallery_alt": "My team at Amazon after finishing an escape room", "gallery_reflection":"I did an internship at Amazon! It was honestly a really challenging experience - I spent weeks tryng to set up my laptop with the right systems, and I also had to change my project partially through the internship! Despite this, I grew to be a lot more confident in my ability as a software engineer. My work over the summer was mostly hybrid, but I really liked going into the office every day. (Not just for the free barista drinks) One of my favorite parts of the internship was meeting the other interns and other team members to do an escape room!"},
            {"gallery_img":"\\img\\journey\\Sophomore Year\\Summer\\WINFO summer takeover.jpg", "gallery_alt": "My team at Amazon after finishing an escape room", "gallery_reflection":"I did an internship at Amazon! It was honestly a really challenging experience - I spent weeks tryng to set up my laptop with the right systems, and I also had to change my project partially through the internship! Despite this, I grew to be a lot more confident in my ability as a software engineer. My work over the summer was mostly hybrid, but I really liked going into the office every day. (Not just for the free barista drinks) One of my favorite parts of the internship was meeting the other interns and other team members to do an escape room!"}
        ]

    }
    
]